[
  {
    "message": "#ЗубыНаЗаметку\n\n#ЕдаДляЗубов\n\nСтоматолог Елена Мартынова рассказала, что для здоровья зубов важно пить воду, есть молочные продукты, мясо, рыбу, яйца, овощи и зелень, а также горький шоколад. Она подчеркнула, что гигиена полости рта также важна для здоровья зубов.\n\n#ЗожНости 🧐 https://www.gazeta.ru/social/news/2024/07/30/23563987.shtml",
    "type": "image",
    "update_id": 3600932,
    "file_path": "https://resizer.mail.ru/p/2ccc744c-a13a-5388-81d4-ee91c8990440/AQAEnrUfyU6ksJODWcPYkuPx4QiM_D-05yLg-N4RS468r9e6rYrrrzg3YbBjSo56LvuUYRL1paqd2wUbhao1_PY8P8U.jpg",
    "file_local": "3600932_branded.jpg",
    "url": "https://www.gazeta.ru/social/news/2024/07/30/23563987.shtml",
    "tmp_long_text": "Однако от того, что человек ест в течение жизни, зависит качественный состав и прочность эмали. О том, какие продукты полезны для здоровья зубов, «Газете.Ru» рассказала стоматолог-терапевт, пародонтолог «СМ-Стоматология», к.м.н. Елена Мартынова. Она отметила, что организм человека не способен вырабатывать витамины и микроэлементы, их можно получить только из продуктов питания. «Самый главный продукт для здоровья зубов — это вода. Правильный питьевой режим (до двух литров в сутки) позволяет обеспечить достаточное количество слюны, а за счет ее омывающей способности снижается количество бактерий. Кроме того, в воде содержится фтор, предупреждающий развитие кариеса. Однако следует понимать, что фильтры обратного осмоса убирают фтор из воды, то же касается и многих бутилированных вариантов. Следовательно, очень важно выбрать правильную воду», — рассказала Мартынова. Кальций, фосфор и фтор — основные минералы эмали, это каркас ее кристаллической решетки. Мы получаем кальций из молочных продуктов и сыров. Обязательное условие для его усвоения — это достаточный уровень витамина D. Фосфор содержится в мясе, рыбе жирных сортов, морепродуктах и яйцах. «Полезную микрофлору в полости рта необходимо поддерживать, употребляя квашеные продукты и напитки на основе чайного гриба», — добавила врач. Овощи и зелень, по ее словам, помогают самоочищению эмали и обеспечивают массаж десен при жевании. Фитонциды растений нейтрализуют токсины бактерий и подавляют их рост. Витамин С, который усваивается из фруктов и овощей, способствует укреплению сосудов десны и костной ткани. «Горький шоколад — это самое безобидное лакомство. И он тоже улучшает здоровье зубов. Плюс это энергия и настроение. Однако значимая концентрация растительных компонентов и минимум сахара — только в горьком шоколаде с содержанием какао-бобов 80% и выше. Благодаря такому составу снижается уровень кислот, которые вырабатывают бактерии полости рта, и не происходит развития кариозного процесса», — отметила стоматолог. Из этого, по словам специалиста, следует вывод, что полезное меню для зубов и десен полностью соответствует здоровому рациону для организма в целом. Баланс обмена веществ и витаминов обеспечивает поддержание здоровья полости рта и костной ткани. «Но даже если мы питаемся только продуктами, которые улучшают здоровье зубов, но при этом не соблюдаем гигиену полости рта, кариес и заболевания десен обязательно возникнут. Единственный вариант сохранить здоровье ваших зубов — два раза в год посещать стоматолога для осмотра и профессиональной гигиены полости рта, а также подбора щетки и пасты для домашней гигиены», — резюмировала врач. ",
    "tmp_file_owner": "Unsplash.com"
  }
]